app/controllers/songs_controller.rb

  def new
    if id = params[:artist_id]
      @song = Song.new(artist_id: id)
      redirect_to artists_path if Artist.find_by(id: id).nil?
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    if id = params[:artist_id]
      artist = Artist.find_by(id: id)
      if artist.nil?
        redirect_to artists_path, alert: "Artist not found"
      else
        @song = artist.songs.find_by(id: params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1]]

  def update
    @song = Song.find(params[:id])

    @song.update(song_params)
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "songs" SET "title" = ?, "artist_id" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["title", "jenny shmenni"], ["artist_id", 2], ["updated_at", "2017-12-01 04:19:29.771368"], ["id", 9]]